---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyUnusedNestedFamilies
source: html/152d7d7a-b1e6-593b-76f0-30ff5de01895.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ManyUnusedNestedFamilies Property

Family contains other families loaded into it but not used. Consider purging family document from unused families and types.

## Syntax (C#)
```csharp
public static FailureDefinitionId ManyUnusedNestedFamilies { get; }
```